app/views/albums/index.html.erb

        <p class="album-title"><%= album.title %>:</p>
        <%= link_to image_tag(album.images.last.image_path(:thumb), class: "album-thumb"), album_path(album), class: "album-link", data: {"reveal-id" => "second-modal"} %>
---
SELECT "albums".* FROM "albums" ORDER BY "albums"."created_at" DESC