app/controllers/admins_controller.rb

INSERT INTO "admins" ("created_at", "email", "encrypted_password", "updated_at") VALUES (?, ?, ?, ?)
---
  def create
    @admin = Admin.new(admin_params)
    @admin.save

SELECT "admins".* FROM "admins" WHERE "admins"."id" = 1 ORDER BY "admins"."id" ASC LIMIT 1
DELETE FROM "admins" WHERE "admins"."id" = ?  [["id", 2]]
---
  def delete
    @admin = Admin.find(params[:id])
    @admin.destroy