app/controllers/albums_controller.rb

SELECT "albums".* FROM "albums" ORDER BY "albums"."created_at" DESC
---
  def index
    @albums = Album.all.order(:created_at).reverse_order

SELECT "albums".* FROM "albums" WHERE "albums"."id" = 1 ORDER BY "albums"."id" ASC LIMIT 1
---
  def show
    @album = Album.where(id: params[:id]).first

INSERT INTO "albums" ("created_at", "description", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Sun, 06 Apr 2014 02:05:44 UTC +00:00], ["description", ""], ["title", "first album"], ["updated_at", Sun, 06 Apr 2014 02:05:44 UTC +00:00]]
---
  def create
    @album = Album.new(album_params)
    if @album.save

SELECT "albums".* FROM "albums" WHERE "albums"."id" = 2 ORDER BY "albums"."id" ASC LIMIT 1
---
  def edit
    @album = Album.where(id: params[:id]).first

SELECT "albums".* FROM "albums" WHERE "albums"."id" = 2 ORDER BY "albums"."id" ASC LIMIT 1
---
  def update
    @album = Album.where(id: params[:id]).first

SELECT "albums".* FROM "albums" WHERE "albums"."id" = 2 ORDER BY "albums"."id" ASC LIMIT 1
DELETE FROM "albums" WHERE "albums"."id" = ?  [["id", 2]]
---
  def destroy
    @album = Album.where(id: params[:id]).first
    @album.destroy