app/controllers/images_controller.rb

  def index
    @album = Album.where(id: params[:album_id]).first
---
SELECT "albums".* FROM "albums" WHERE "albums"."id" = 1 ORDER BY "albums"."id" ASC LIMIT 1

  def new
    @album = Album.where(id: params[:album_id]).first
---
SELECT "albums".* FROM "albums" WHERE "albums"."id" = 1 ORDER BY "albums"."id" ASC LIMIT 1

  def show
    @image = Image.where(id: params[:id]).first
---
SELECT "images".* FROM "images" WHERE "images"."id" = 2 ORDER BY "images"."id" ASC LIMIT 1

  def create
    @album = Album.where(id: params[:album_id]).first
    @order_number = @album.images.count + 1
    @image = @album.images.new(new_image_params.merge(order: @order_number))

    if params[:image]
      if @image.save
---
SELECT "albums".* FROM "albums" WHERE "albums"."id" = ? ORDER BY "albums"."id" ASC LIMIT 1  [["id", 1]]
SELECT COUNT(*) FROM "images" WHERE "images"."album_id" = ?  [["album_id", 1]]
INSERT INTO "images" ("album_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["album_id", 1], ["created_at", Sun, 06 Apr 2014 13:34:37 UTC +00:00], ["updated_at", Sun, 06 Apr 2014 13:34:37 UTC +00:00]]